<details><summary>Click me</summary>```Terraform detected the following changes made outside of Terraform since the 
last "terraform apply":

  # module.iam.google_project_iam_binding.serviceAccountUser has been changed
  ~ resource "google_project_iam_binding" "serviceAccountUser" {
      ~ etag    = "BwXlcCHSPp4=" -> "BwXl44SsJuw="
        id      = "i-digital-adsales-uat/roles/iam.serviceAccountUser"
        # (3 unchanged attributes hidden)
    }
  # module.iam.google_project_iam_binding.stackdriver_admin has been changed
  ~ resource "google_project_iam_binding" "stackdriver_admin" {
      ~ etag    = "BwXlcCHSPp4=" -> "BwXl44SsJuw="
        id      = "i-digital-adsales-uat/roles/monitoring.admin"
        # (3 unchanged attributes hidden)
    }
  # module.iam.google_project_iam_binding.viewers has been changed
  ~ resource "google_project_iam_binding" "viewers" {
      ~ etag    = "BwXlcCHSPp4=" -> "BwXl44SsJuw="
        id      = "i-digital-adsales-uat/roles/viewer"
        # (3 unchanged attributes hidden)
    }
  # module.iam.google_project_iam_binding.base has been changed
  ~ resource "google_project_iam_binding" "base" {
      ~ etag    = "BwXlcCHSPp4=" -> "BwXl44SsJuw="
        id      = "i-digital-adsales-uat/organizations/1015867442176/roles/cbsibase"
        # (3 unchanged attributes hidden)
    }
  # module.iam.google_project_iam_binding.datastore has been changed
  ~ resource "google_project_iam_binding" "datastore" {
      ~ etag    = "BwXlcCHSPp4=" -> "BwXl44SsJuw="
        id      = "i-digital-adsales-uat/roles/datastore.owner"
        # (3 unchanged attributes hidden)
    }
  # module.iam.google_project_iam_binding.networkAdmin has been changed
  ~ resource "google_project_iam_binding" "networkAdmin" {
      ~ etag    = "BwXlcCHSPp4=" -> "BwXl44SsJuw="
        id      = "i-digital-adsales-uat/roles/compute.networkAdmin"
        # (3 unchanged attributes hidden)
    }
  # module.iam.google_project_iam_binding.quota_admin has been changed
  ~ resource "google_project_iam_binding" "quota_admin" {
      ~ etag    = "BwXlcCHSPp4=" -> "BwXl44SsJuw="
        id      = "i-digital-adsales-uat/roles/servicemanagement.quotaAdmin"
        # (3 unchanged attributes hidden)
    }
  # module.iam_cbsi_dss_bq_developer.google_project_iam_binding.binding has been changed
  ~ resource "google_project_iam_binding" "binding" {
      ~ etag    = "BwXlcCHSPp4=" -> "BwXl44SsJuw="
        id      = "i-digital-adsales-uat/organizations/1015867442176/roles/cbsidssbqdeveloper"
        # (3 unchanged attributes hidden)
    }
  # module.iam_dss_datacatalog_user.google_project_iam_binding.binding has been changed
  ~ resource "google_project_iam_binding" "binding" {
      ~ etag    = "BwXlcCHSPp4=" -> "BwXl44SsJuw="
        id      = "i-digital-adsales-uat/organizations/1015867442176/roles/dssdatacatalog"
        # (3 unchanged attributes hidden)
    }
  # module.iam_bq_viewer_binding.google_project_iam_binding.binding has been changed
  ~ resource "google_project_iam_binding" "binding" {
      ~ etag    = "BwXlcCHSPp4=" -> "BwXl44SsJuw="
        id      = "i-digital-adsales-uat/roles/bigquery.dataViewer"
        # (3 unchanged attributes hidden)
    }
  # module.iam_bq_readsession_binding.google_project_iam_binding.binding has been changed
  ~ resource "google_project_iam_binding" "binding" {
      ~ etag    = "BwXlcCHSPp4=" -> "BwXl44SsJuw="
        id      = "i-digital-adsales-uat/roles/bigquery.readSessionUser"
        # (3 unchanged attributes hidden)
    }
  # module.iam_dts_bigquery_user.google_project_iam_binding.binding has been changed
  ~ resource "google_project_iam_binding" "binding" {
      ~ etag    = "BwXlcCHSPp4=" -> "BwXl44SsJuw="
        id      = "i-digital-adsales-uat/organizations/1015867442176/roles/dts.bigquery.user"
        # (3 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.digital_databricks_sa2.google_service_account.serviceaccount will be created
  + resource "google_service_account" "serviceaccount" {
      + account_id   = "digital-databricks2"
      + disabled     = false
      + display_name = "digital-databricks2"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "i-digital-adsales-uat"
      + unique_id    = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```</details>